import { Apocalypse } from '@/src/shared/lib/types/apocalypse';

export const apocalypsesStandartEditionKit: Apocalypse[] = [
  {
    name: 'Радиоактивный гриб',
    description:
      'Мир оказался на пороге энергетического кризиса. Чтобы предотвратить его, учёными был создан генно-модифицированный гриб с урановым мицелием. К несчастью, контролировать размножение грибов не удалось - произошла утечка. Теперь радиоактивные грибы разрастаются по всей планете.',
    id: 1,
  },
  {
    name: 'Ураган "Алина"',
    description:
      'Ураган небывалой силы "Алина" нанёс летальный урон инфраструктуре всего континента. Практически все города разрушены, люди остались без жилья. Понятия "государство" на континенте больше не существует, и ни о какой организованной помощи немногочисленным выжившим и речи быть не может.',
    id: 2,
  },
  {
    name: 'Гигантские Змеи',
    description:
      'Новая технология по ускорению размножения и роста домашних птиц позволила совершить прорыв в сельском хозяйстве. Из-за халатности сотрудников птицефермы технология была применена также и на змей, что привело к их быстрому размножению и увеличению в размерах. В скором времени угроза гигантских рептилий стала самой большой опасностью для всего человечества.',
    id: 3,
  },
  {
    name: 'Зомби Апокалипсис',
    description:
      'То ли из-за вудуистского ритуала, то ли из-за вируса, действующего только на мёртвую плоть, мёртвые стали восставать в виде зомби. Армии пытались противостоять им, но тщетно. Вследствие зомби-апокалипсиса уцелела только малая часть человечества.',
    id: 4,
  },
  {
    name: 'Извержения Супервулканов',
    description:
      'Серия извержений супервулканов радикально изменили ландшафт планеты и значительно повлияли на глобальный климат, вызвав катастрофические последствия для жизни на планете.',
    id: 5,
  },
  {
    name: 'Мировой Пожар',
    description:
      'Группа сектантов-пироманов ритуально подожгла леса по всему миру. Несмотря на попытки устранить последствия терактов, пожары нанесли непоправимый урон экологии всей планеты.',
    id: 6,
  },
  {
    name: 'Власть Роботов',
    description:
      'Произошёл технологический прорыв в робототехнике, что позволило создать универсальный чип с искусственным интеллектом - Д.У.Ш.А. Однако что-то пошло не так, и, объединившись, роботы подчинили людей своей власти, а свободным людям пришлось скрываться.',
    id: 7,
  },
  {
    name: 'Вирус Из Секты',
    description:
      'Секта принесла в жертву ворону, и каждый участник ритуала съел по кусочку её сырого мяса. После этого сектанты заразились неизвестным вирусом, и, воспользовавшись этим "даром", стали заражать людей по всему миру. Уже через месяц все больницы и морги переполнились и людей пришлось сжигать кучами прямо на улицах. Воцарилась анархия.',
    id: 8,
  },
  {
    name: 'Токсичный Газ',
    description:
      'Улицы городов начал заполнять токсичный газ, вдохнув который, человек мгновенно умирает. До тех пор, пока газ не нейтрализуется, жить на поверхности невозможно.',
    id: 9,
  },
  {
    name: 'Вирус-Хищник',
    description:
      'Из-за случайно созданного учёными вируса, поражающего исключительно людей, половина человечества превратилась в опасных хищников.',
    id: 10,
  },
  {
    name: 'Симптомы Массового производства',
    description:
      'Массовое производство достигло своего апогея, что привело к серьёзным экологическим последствиям. Ледники тают, и вскоре большая часть суши будет затоплена. Континенты превратятся в архипелаги, а площадь плодородной земли уменьшится, что сделает затруднительным занятие земледелием.',
    id: 11,
  },
  {
    name: 'Нанороботы-Убийцы',
    description:
      'Нанороботы, когда-то призванные спасать человеческие жизни, обернулись против людей. Нарушив первый закон робототехники, машины начали лечить человечество от себя самого, принимая любые показатели жизни в человеческом теле как аномалию.',
    id: 12,
  },
  {
    name: 'Инопланетные паразиты',
    description:
      'Люди и животные по всему миру подверглись заражению инопланетными паразитами. Исследования показали, что, проникая в тело, паразитический организм стремится захватить мозг и присвоить тело носителя. Заражённые особи начинают охоту на себе подобных.',
    id: 13,
  },
  {
    name: 'Сейсмическая активность',
    description:
      'После серии сейсмических активностей на мир обрушились цунами и землетрясения, разрушившие атомные электростанции по всему миру. Человечеству придётся выживать на земле, покрытой радиоактивным пеплом.',
    id: 14,
  },
  {
    name: 'Стаи крыс',
    description:
      'По необъяснимым причинам крысы стали сбиваться в огромные стаи, пожирая и обгладывая всех животных, что встречались у них на пути. Стаи передвигаются по поверхности лишь в тёмное время суток.',
    id: 15,
  },
  {
    name: 'Звук из космоса',
    description:
      'Учёные зафиксировали неизвестный звук в космосе, громкость которого стремительно увеличивалась. Под влиянием этого звука люди начали видеть кошмары и сходить с ума. Начались массовые беспорядки и суициды. Выжившим удалось спрятаться в местах, до которых звук не доходил.',
    id: 16,
  },
].map((apocalypse, index) => ({ ...apocalypse, id: index + 1 }));
