import { Apocalypse } from '@/src/shared/lib/types/apocalypse';

export const apocalypsesStandartEditionKit: Apocalypse[] = [
  {
    name: 'Радиоактивный гриб',
    description:
      'Мир оказался на пороге энергетического кризиса. Чтобы предотвратить его, учёными был создан генно-модифицированный гриб с урановым мицелием. К несчастью, контролировать размножение грибов не удалось - произошла утечка. Теперь радиоактивные грибы разрастаются по всей планете.',
  },
  {
    name: 'Ураган "Алина"',
    description:
      'Ураган небывалой силы "Алина" нанёс летальный урон инфраструктуре всего континента. Практически все города разрушены, люди остались без жилья. Понятия "государство" на континенте больше не существует, и ни о какой организованной помощи немногочисленным выжившим и речи быть не может.',
  },
  {
    name: 'Гигантские Змеи',
    description:
      'Новая технология по ускорению размножения и роста домашних птиц позволила совершить прорыв в сельском хозяйстве. Из-за халатности сотрудников птицефермы технология была применена также и на змей, что привело к их быстрому размножению и увеличению в размерах. В скором времени угроза гигантских рептилий стала самой большой опасностью для всего человечества.',
  },
  {
    name: 'Зомби Апокалипсис',
    description:
      'То ли из-за вудуистского ритуала, то ли из-за вируса, действующего только на мёртвую плоть, мёртвые стали восставать в виде зомби. Армии пытались противостоять им, но тщетно. Вследствие зомби-апокалипсиса уцелела только малая часть человечества.',
  },
  {
    name: 'Извержения Супервулканов',
    description:
      'Серия извержений супервулканов радикально изменили ландшафт планеты и значительно повлияли на глобальный климат, вызвав катастрофические последствия для жизни на планете.',
  },
  {
    name: 'Мировой Пожар',
    description:
      'Группа сектантов-пироманов ритуально подожгла леса по всему миру. Несмотря на попытки устранить последствия терактов, пожары нанесли непоправимый урон экологии всей планеты.',
  },
  {
    name: 'Власть Роботов',
    description:
      'Произошёл технологический прорыв в робототехнике, что позволило создать универсальный чип с искусственным интеллектом - Д.У.Ш.А. Однако что-то пошло не так, и, объединившись, роботы подчинили людей своей власти, а свободным людям пришлось скрываться.',
  },
  {
    name: 'Вирус Из Секты',
    description:
      'Секта принесла в жертву ворону, и каждый участник ритуала съел по кусочку её сырого мяса. После этого сектанты заразились неизвестным вирусом, и, воспользовавшись этим "даром", стали заражать людей по всему миру. Уже через месяц все больницы и морги переполнились и людей пришлось сжигать кучами прямо на улицах. Воцарилась анархия.',
  },
  {
    name: 'Токсичный Газ',
    description:
      'Улицы городов начал заполнять токсичный газ, вдохнув который, человек мгновенно умирает. До тех пор, пока газ не нейтрализуется, жить на поверхности невозможно.',
  },
];
